import React from "react";
import SpecialtiesSwiper from "./SpecialtiesSwiper";
import Heading from "../Shared/Heading/Heading";

export const specialties = [
  {
    name: "সাধারণ চিকিৎসা",
    description:
      "সাধারণ স্বাস্থ্য সমস্যার জন্য অভিজ্ঞ ডাক্তারদের সেবা, যেমন ঠান্ডা, জ্বর, মাথাব্যথা ইত্যাদি।",
  },
  {
    name: "শিশু রোগ বিশেষজ্ঞ",
    description:
      "শিশুদের রোগ নির্ণয় এবং চিকিৎসা। অভিজ্ঞ শিশু বিশেষজ্ঞদের মাধ্যমে উন্নত সেবা।",
  },
  {
    name: "হৃদরোগ বিশেষজ্ঞ",
    description:
      "হৃদরোগ ও রক্তচাপ সংক্রান্ত সমস্যা নির্ণয় ও চিকিৎসা। বিশেষজ্ঞ কার্ডিওলজিস্টদের মাধ্যমে সেবা।",
  },
  {
    name: "চর্মরোগ বিশেষজ্ঞ",
    description:
      "ত্বক, চুল এবং নখ সংক্রান্ত রোগ নির্ণয় ও চিকিৎসা। কার্যকরী এবং দ্রুত সমাধান।",
  },
  {
    name: "মানসিক স্বাস্থ্য সেবা",
    description:
      "মানসিক সুস্থতা, স্ট্রেস এবং ডিপ্রেশনসহ মানসিক সমস্যা সমাধান। অভিজ্ঞ সাইকোলজিস্টদের মাধ্যমে কনসালটেশন।",
  },
  {
    name: "নারী ও প্রসূতি সেবা",
    description:
      "মহিলা রোগ বিশেষজ্ঞ ও প্রসূতি সেবা। গর্ভকালীন পর্যবেক্ষণ এবং স্বাস্থ্য নির্দেশনা।",
  },
  {
    name: "দাঁতের চিকিৎসা (ডেন্টাল)",
    description:
      "দাঁত ও মুখের সমস্যা নির্ণয় ও চিকিৎসা। অভিজ্ঞ ডেন্টাল সার্জন এবং চেকআপ সুবিধা।",
  },
  {
    name: "চক্ষু রোগ বিশেষজ্ঞ",
    description:
      "চোখের সমস্যা নির্ণয় ও চিকিৎসা। ভিশন চেকআপ এবং লেজার বা সার্জারি সুবিধা।",
  },
  {
    name: "কিডনি এবং ইউরোলজি",
    description:
      "কিডনি, প্রস্রাব এবং ইউরোলজি সংক্রান্ত রোগ নির্ণয় ও চিকিৎসা। বিশেষজ্ঞ চিকিৎসকদের মাধ্যমে সেবা।",
  },
  {
    name: "হাড় ও জয়েন্ট বিশেষজ্ঞ (অর্থোপেডিক্স)",
    description:
      "হাড়, জয়েন্ট এবং মাংসপেশী সমস্যা নির্ণয় ও চিকিৎসা। কার্যকরী ফিজিওথেরাপি ও সার্জারি।",
  },
  {
    name: "নাক, কান এবং গলা (ENT)",
    description:
      "নাক, কান এবং গলার সমস্যা নির্ণয় ও চিকিৎসা। বিশেষজ্ঞ ENT ডাক্তারদের মাধ্যমে সেবা।",
  },
  {
    name: "ডায়াবেটিস ও এন্ডোক্রাইনোলজি",
    description:
      "ডায়াবেটিস, থাইরয়েড এবং হরমোন সংক্রান্ত সমস্যা নির্ণয় ও চিকিৎসা। অভিজ্ঞ এন্ডোক্রাইনোলজিস্টদের মাধ্যমে কনসালটেশন।",
  },
];

const SpecialtiesSection = () => {
  return (
    <section className="py-16">
      <Heading title="চিকিৎসা বিভাগসমূহ" />
      <SpecialtiesSwiper data={specialties} />
    </section>
  );
};

export default SpecialtiesSection;
